Repository: DIKO-Doc/DIKO-Doc.github.io
Catalog: cht-to-eng/cht-to-eng-omegat.tmx
Source language: zh_tw
Languages: en

source: extra semicolon in struct or union specified
en: 為結合或結構指定了多餘的分號

source: failed to find class '%s'
en: 找不到類別「%s」

source: failed to load nm_vpn_editor_plugin_factory() from %s (%s)
en: 無法從中加載nm_vpn_editor_plugin_factory（） %s （%s)

source: fastcall and cdecl attributes are not compatible
en: fastcall 和 cdecl 屬性互不相容

source: fatal error:
en: 嚴重錯誤：

source: field %q+#D with same name as class
en: 欄位 %q+#D 與類別同名

source: field %q+D invalidly declared function type
en: 欄位 %q+D 無效地宣告為函式類型

source: field %qD has incomplete type
en: 欄位 %qD 類型不完全

source: field %qs not found
en: 找不到欄位 %qs。

source: field '%s' has to be alone
en: 欄位 '%s' 必須是單獨的

source: field initializer is not constant
en: 欄位初始值設定不是一個常數

source: field name not in record or union initializer
en: 欄位名不在記錄或聯合初始化設定中

source: field width
en: 欄位寬

source: field width in printf format
en: printf 格式的欄位寬度

source: field width in scanf format
en: scanf 格式的欄位寬

source: field width in strfmon format
en: strfmon 格式的欄位寬度

source: field width in strftime format
en: strftime 格式的欄位寬度

source: file
en: 檔案

source: file '%s' contains non-valid utf-8
en: 檔案'%s' 包含無效的utf-8

source: file ends in default argument
en: 檔案在預設參數處結束

source: file permissions for %s
en: 文件權限 %s

source: filename has invalid format (%s)
en: 文件名格式無效（%s)

source: filename must be an absolute path (%s)
en: filename必須是絕對路徑（%s)

source: fill character
en: 填充字元

source: fill character in strfmon format
en: strfmon 格式的填充字元

source: find_enum(): Enum not found
en: find_enum()：找不到列舉

source: fini function found in object %s
en: 在物件 %s 中發現 fini 函式

source: first argument of %q+D should be %<int%>
en: %q+D 的第一個參數的類型應該是 %<int%>

source: first argument to %<va_arg%> not of type %<va_list%>
en: 給 %<va_arg%> 的第一個參數的類型不是 %<va_list%>

source: flags are invalid
en: 旗標不合規定

source: flags invalid
en: 旗標不合規定

source: flags invalid - disabled
en: 旗標不合規定 - 已停用

source: floating constant misused
en: 錯誤地使用了浮點常數

source: floating point constant not a valid immediate operand
en: 浮點常數不是一個有效的立即數值運算元

source: flow control insn inside a basic block
en: 基本區塊內有流程控制指令

source: folder
en: 資料夾

source: for conversion from %qT to %qT
en: 當從 %qT 轉換為 %qT 時

source: format argument %d unused before used argument %d in $-style format
en: 格式引數 %d 在被使用的 $ 風格的格式引數 %d 前未被使用

source: format argument %d used more than once in %s format
en: 格式引數 %d 在 %s 格式字串中使用不止一次

source: format is a wide character string
en: 格式字串是一個寬字串

source: format not a string literal and no format arguments
en: 格式字串不是一個字面字串而且沒有待格式化的引數

source: format not a string literal, argument types not checked
en: 格式字串不是一個字面字串，沒有進行引數類型檢查

source: format not a string literal, format string not checked
en: 格式字串不是一個字面字串，格式字串未被檢查

source: format string argument follows the args to be formatted
en: 格式字串出現在待格式化的引數之後

source: format string has invalid operand number
en: 格式字串的運算元號無效

source: found a real definition for a non-register
en: 找到非暫存器的真實定義

source: fr30_print_operand: invalid %%F code
en: fr30_print_operand：無效的 %%F 程式碼

source: fr30_print_operand: invalid %%x code
en: fr30_print_operand：無效的 %%x 程式碼

source: fr30_print_operand: invalid operand to %%A code
en: fr30_print_operand：%%A 程式碼運算元無效

source: fr30_print_operand: unhandled MEM
en: fr30_print_operand：未處理的 MEM

source: fr30_print_operand: unknown code
en: fr30_print_operand：不明程式碼

source: fr30_print_operand: unrecognized %%B code
en: fr30_print_operand：無法辨識的 %%B 程式碼

source: fr30_print_operand: unrecognized %%b code
en: fr30_print_operand：無法辨識的 %%b 程式碼

source: fr30_print_operand: unrecognized %%p code
en: fr30_print_operand：無法辨識的 %%p 程式碼

source: fr30_print_operand_address: unhandled address
en: fr30_print_operand：未處理的指標

source: frame size too large for reliable stack checking
en: 對可靠的堆疊檢查來說框架太大了

source: friend declaration does not name a class or function
en: 夥伴宣告沒有指定類別或函式名

source: friend declaration requires class-key, i.e. %<friend %#T%>
en: 夥伴宣告需要 class，即 %<friend %#T%>

source: friend declaration requires class-key, i.e. %<friend class %T::%D%>
en: 夥伴宣告需要 class，即 %<friend class %T::%D%>

source: from definition of %q+#D
en: 從 %q+#D 的定義

source: from here
en: 從這裡

source: from this location
en: 從這個地方

source: frv_print_operand: unknown code
en: frv_print_operand：不明程式碼

source: full
en: 已滿

source: function %q+D definition is marked dllimport
en: 函式 %q+D 的定義被標記為 dllimport

source: function %q+D redeclared as inline
en: 函式 %q+D 重宣告為內聯的

source: function %q+D redeclared with attribute noinline
en: 函式 %q+D 重宣告為帶有不可內聯屬性

source: function %q+F can never be inlined because it contains a computed goto
en: 函式 %q+F 無法被內聯，因為包含一個執行時 goto

source: function %q+F can never be inlined because it is suppressed using -fno-inline
en: 函式 %q+F 無法被內聯，因為使用了 -fno-inline

source: function %q+F can never be inlined because it uses __builtin_return or __builtin_apply_args
en: 函式 %q+F 無法被內聯，因為使用了 __builtin_return 或 __builtin_apply_args

source: function %q+F can never be inlined because it uses alloca (override using the always_inline attribute)
en: 函式 %q+F 無法被內聯，因為它使用了 alloca (使用 always_inline 屬性強制內聯)

source: function %q+F can never be inlined because it uses non-local goto
en: 函式 %q+F 無法被內聯，因為使用了非區域性的 goto

source: function %q+F can never be inlined because it uses setjmp
en: 函式 %q+F 無法被內聯，因為它使用了 setjmp

source: function %q+F can never be inlined because it uses setjmp-longjmp exception handling
en: 函式 %q+F 無法被內聯，因為它使用了 setjmp-longjmp 異常處理

source: function %q+F can never be inlined because it uses variable argument lists
en: 函式 %q+F 無法被內聯，因為它使用了變長引數表

source: function %qD declared virtual inside a union
en: 聯合成員函式 %qD 被宣告為虛函式

source: function %qD is initialized like a variable
en: 函式 %qD 像變數一樣被初始化

source: function %qs cannot be declared %<mutable%>
en: 函式 %qs 不能被宣告為 %<mutable%>

source: function body not available
en: 函式體無法使用

source: function call has aggregate value
en: 函式呼叫有聚合類型

source: function declaration isn%'t a prototype
en: 函式宣告不是一個原型

source: function declared %<noreturn%> has a %<return%> statement
en: 被宣告為 %<noreturn%> 的函式卻有 %<return%> 敘述

source: function definition declared %<auto%>
en: 函式宣告定義為 %<auto%>

source: function definition declared %<register%>
en: 函式宣告定義為 %<register%>

source: function definition declared %<typedef%>
en: 函式宣告定義為 %<typedef%>

source: function definition has qualified void return type
en: 函式定義有限定的 void 回傳類型

source: function might be possible candidate for %qs format attribute
en: 函式可能是 %qs format 屬性的備選

source: function not considered for inlining
en: 不考慮內聯函式

source: function not inlinable
en: 函式不能內聯

source: function return type cannot be function
en: 函式不能回傳函式

source: function return types not compatible due to %<volatile%>
en: 由於 %<volatile%>，函式回傳類型不相容

source: function returning a function
en: 函式回傳了一個函式

source: function returning an array
en: 函式回傳了一個陣列

source: function returns address of local variable
en: 函式回傳局部變數的位址

source: function returns an aggregate
en: 函式回傳一個聚合

source: function template partial specialization %qD is not allowed
en: 函式範本部分特例化 %qD 是不允許的

source: function types not truly compatible in ISO C
en: 函式類型與 ISO C 不完全相容

source: function-scope %qs implicitly auto and declared %<__thread%>
en: 函式作用欄位的 %qs 隱含為 auto，卻被宣告為 %<__thread%>

source: function_profiler support
en: function_profiler 支援

source: function_profiler support for MMIX
en: 對 MMIX 的 function_profiler 支援

source: fw missing
en: fw失踪了

source: garbage at the end of value %s: '%s'
en: 垃圾在價值的最後 %s: “%s'

source: gateway cannot be set if there are no addresses configured
en: 如果沒有配置地址，則無法設置網關

source: gfc_trans_code(): Bad statement code
en: gfc_trans_code()：錯誤的敘述程式碼

source: global constructors not supported on this target
en: 全域建構式在此目標平臺上不受支援

source: global declaration %q+#D
en: 全域宣告 %q+#D

source: global destructors not supported on this target
en: 全域解構函式在此目標平臺上不受支援

source: global register variable %qD used in nested function
en: 巢狀函式中使用了全域暫存器變數 %qD

source: global register variable has initial value
en: 全域暫存器變數有初始值

source: go to item at given line number
en: goutu aitèm given lain number

source: got %d template parameters for %q#D
en: 得到 %d 個範本參數，為 %q#D

source: got %d template parameters for %q#T
en: 得到 %d 個範本參數，為 %q#T

source: gp is constant (but save/restore gp on indirect calls)
en: gp 是常數(但當間接呼叫時儲存/恢復 gp)

source: had to relocate PCH
en: 必須重新定位 PCH

source: handle a poedit:// URI
en: händol 1-gè poedit:// URI

source: has to match '%s' property for PKCS#12
en: 必須符合 PKCS#12 的 '%s' 屬性

source: ia64_print_operand: unknown code
en: ia64_print_operand：不明程式碼

source: identifier expected after %<@protocol%>
en: %<@protocol%> 需要識別碼

source: if this code is reached, the program will abort
en: 如果執行到這段程式碼，程式將中止

source: iface
en: 我面對

source: ignoring -fschedule-insns because of exception handling bug
en: 忽略 -fschedule-insns 以繞開異常處理的缺陷

source: ignoring asm-specifier for non-static local variable %q+D
en: 為非靜態局部變數 %q+D 忽略了 asm 限定符

source: ignoring duplicate directory "%s"
en: 忽略重複的目錄「%s」

source: ignoring invalid DNS server IPv%c address '%s'
en: 忽略無效的DNS服務器IPv6%c 地址 '%s'

source: ignoring invalid SSID
en: 忽略無效的SSID

source: ignoring invalid byte element '%d' (not between 0 and 255 inclusive)
en: 忽略無效的字節元素'%d' （不在0到255之間）

source: ignoring invalid raw password
en: 忽略無效的原始密碼

source: ignoring invalid team configuration: %s
en: 忽略無效的團隊配置： %s

source: ignoring malformed #pragma longcall
en: 忽略格式錯誤的 #pragma longcall

source: ignoring missing number
en: 忽略丟失的號碼

source: ignoring nonexistent directory "%s"
en: 忽略不存在的目錄「%s」

source: illegal reference type specified for instance variable %qs
en: 為實體變數 %qs 指定了無效的參照類型

source: implicit declaration of function %qE
en: 隱含宣告函式 %qE

source: implied END DO
en: 暗示的 END DO

source: impossible constraint in %<asm%>
en: %<asm%> 中不可能的約束

source: impossible register constraint in %<asm%>
en: %<asm%> 中不可能的暫存器約束

source: in %s, at %s:%d
en: 在 %s 中，於 %s:%d

source: in call to %qD
en: 在呼叫 %qD 時

source: in declaration %q+D
en: 在宣告 %q+D 中

source: in instantiation of template %qT
en: 在範本 %qT 的實體化中

source: in passing argument %P of %q+D
en: 在傳遞引數 %P (屬於 %q+D)

source: in pointer to member conversion
en: 在成員指標轉換中

source: in pointer to member function conversion
en: 在成員函式指標轉換中

source: in thrown expression
en: 在拋出的運算式中

source: inappropriate accumulator for %qs
en: %qs 的累加器不合適

source: incompatible implicit declaration of built-in function %qD
en: 隱含宣告與內建函式 %qD 不相容

source: incomplete type %qT does not have member %qD
en: 不完全類型 %qT 沒有成員 %qD

source: incomplete type %qT used in nested name specifier
en: 巢狀名指定中使用了不完全的類型 %qT

source: inconsistent instance variable specification
en: 不一致的實體變數指定

source: incorrect insn:
en: 錯誤指令：

source: incorrect item '%s' in '--order' option
en: 錯誤的項目'%s' 在' - order'選項中

source: incorrect sharing of tree nodes
en: 對樹結區段的共享不正確

source: incorrect string '%s' of '--order' option
en: 字符串錯誤'%s' ' - order'選項

source: increment of pointer to unknown structure
en: 自增參照不明結構的指標

source: increment of read-only member %qD
en: 令唯讀成員 %qD 自增

source: increment of read-only variable %qD
en: 令唯讀變數 %qD 自增

source: index value instead of field name in union initializer
en: 在聯合初始值設定中出現了索引值而不是欄位名

source: init function found in object %s
en: 在物件 %s 中發現 init 函式

source: initialization from distinct Objective-C type
en: 從獨一無二的 Objective-C 類型初始化

source: initialization from incompatible pointer type
en: 永遠不相容的指標類型初始化

source: initialization left-hand side might be a candidate for a format attribute
en: 初始化的左手邊可能是 format 屬性的備選時

source: initialization makes integer from pointer without a cast
en: 初始化將指標賦給整數，未作類型轉換

source: initialization makes pointer from integer without a cast
en: 初始化時將整數賦給指標，未作類型轉換

source: initialization of a flexible array member
en: 對彈性陣列成員的初始化

source: initialization of flexible array member in a nested context
en: 在巢狀的上下文中初始化彈性陣列成員

source: initialized variable %q+D is marked dllimport
en: 經初始化的變數 %q+D 被標記為 dllimport

source: initializer element is not computable at load time
en: 初始值設定中的元素在載入時無法被計算出

source: initializer ends prematurely
en: 初始值設定在完成之前結束

source: initializer fails to determine size of %q+D
en: 初始值設定無法決定 %q+D 的大小

source: initializer fails to determine size of %qD
en: 初始值設定無法決定 %qD 的大小

source: initializer specified for non-virtual method %q+D
en: 為非虛方法 %q+D 指定了初始值設定項

source: initializer specified for static member function %qD
en: 為靜態成員函式 %qD 指定了初始值

source: initializer-string for array of chars is too long
en: 用以初始化字元陣列的字串太長

source: initializing argument %P of %qD
en: 初始化引數 %P，屬於 %qD

source: inline declaration of %qD follows declaration with attribute noinline
en: %q+D 帶有 noinline 屬性的宣告出現在其內聯宣告之後

source: inline function %q+D declared as dllimport: attribute ignored
en: 內聯函式 %q+D 宣告為 dllimport：忽略此屬性

source: inline function %q+D used but never defined
en: 使用了內聯函式 %q+D 但從未定義過

source: inlined_to pointer is wrong
en: inlined_to pointer 錯誤

source: inlining failed in call to %q+F: %s
en: 呼叫 %q+F 時內聯失敗：%s

source: input operand constraint contains %qc
en: 輸入運算元約束包含 %qc

source: insn %d inside basic block %d but block_for_insn is %i
en: insn %d 在基本區塊 %d 之內，但是 BLOCK_FOR_INSN 是 %i

source: insn does not satisfy its constraints:
en: 指令不滿足其約束：

source: insn outside basic block
en: 基本區塊外出現指令

source: install: %s%s
en: 安裝：%s%s

source: instance variable assignment has been intercepted
en: 實體變數的賦值被打斷

source: instantiation of %q+D as type %qT
en: %q+D 按類型 %qT 實體化

source: instruction scheduling not supported on this target machine
en: 指令調度在此目標平臺上不受支援

source: integer overflow in expression
en: 整數溢出

source: integral expression %qE is not constant
en: 整型運算式 %qE 不是常數

source: inter-module optimizations not implemented for C++
en: 模組間最佳化淍未為 C++ 實作

source: interface name contains an invalid character
en: 接口名稱包含無效字符

source: interface name is longer than 15 characters
en: 接口名稱超過15個字符

source: interface name is reserved
en: 接口名稱是保留的

source: interface name is too short
en: 界面名稱太短

source: interface name of software infiniband device must be '%s' or unset (instead it is '%s')
en: 軟件infiniband設備的接口名稱必須是'%s' 或者未設置（相反它是'%s')

source: internal and protected visibility attributes not supported in this configuration; ignored
en: 內部和保護的可見性屬性在此配置下不受支援；已忽略

source: internal compiler error. Bad address:
en: 編譯器內部錯誤。錯誤的位址：

source: internal compiler error. Incorrect shift:
en: 編譯器內部錯誤。不正確的移位量：

source: internal compiler error. Unknown mode:
en: 編譯器內部錯誤。不明的模式：

source: internal compiler error:
en: 編譯器內部錯誤：

source: internal consistency failure
en: 內部一致性錯誤

source: internal error - invalid Utf8 name
en: 內部錯誤 - 無效的 utf8 名

source: internal error: bad register: %d
en: 內部錯誤：錯誤的暫存器：%dt

source: invalid #pragma %s
en: 無效的 #pragma %s

source: invalid %%-code
en: 無效的 %%-code

source: invalid %%A operand
en: 無效的 %%A 運算元

source: invalid %%B operand
en: 無效的 %%B 運算元

source: invalid %%C operand
en: 無效的 %%C 運算元

source: invalid %%C value
en: 無效 %%C 值

source: invalid %%D operand
en: 無效的 %%D 運算元

source: invalid %%D value
en: 無效的 %%D 值

source: invalid %%E value
en: 無效 %%E 值

source: invalid %%F value
en: 無效 %%F 值

source: invalid %%G value
en: 無效 %%G 值

source: invalid %%H value
en: 無效 %%H 值

source: invalid %%J code
en: 無效 %%J 程式碼

source: invalid %%J value
en: 無效 %%J 值

source: invalid %%K value
en: 無效 %%K 值

source: invalid %%L value
en: 無效 %%L 值

source: invalid %%M value
en: 無效 %%M 值

source: invalid %%N value
en: 無效 %%N 值

source: invalid %%O value
en: 無效 %%O 值

source: invalid %%P operand
en: 無效的 %%P 運算元

source: invalid %%P value
en: 無效 %%P 值

source: invalid %%R value
en: 無效 %%R 值

source: invalid %%S value
en: 無效 %%S 值

source: invalid %%T value
en: 無效 %%T 值

source: invalid %%U value
en: 無效 %%U 值

source: invalid %%Y operand
en: 無效的 %%Y 運算元

source: invalid %%c operand
en: 無效的 %%c 運算元

source: invalid %%d value
en: 無效的 %%d 值

source: invalid %%f operand
en: 無效的 %%f 運算元

source: invalid %%f value
en: 無效 %%f 值

source: invalid %%h value
en: 無效 %%h 值

source: invalid %%j code
en: 無效 %%j 程式碼

source: invalid %%j value
en: 無效的 %%j 值

source: invalid %%k value
en: 無效 %%k 值

source: invalid %%m value
en: 無效 %%m 值

source: invalid %%p value
en: 無效的 %%p 值

source: invalid %%q value
en: 無效 %%q 值

source: invalid %%r value
en: 無效 %%r 值

source: invalid %%s operand
en: 無效的 %%s 運算元

source: invalid %%s value
en: 無效 %%s 值

source: invalid %%t/%%b value
en: 無效的 %%t/%%b 值

source: invalid %%u value
en: 無效 %%u 值

source: invalid %%v value
en: 無效 %%v 值

source: invalid %%xn code
en: 無效的 %%xn 程式碼

source: invalid '%s' or its value '%s'
en: 無效的「%s」或是它的值「%s」無效

source: invalid 'asm':
en: 無效的「asm」：

source: invalid --param value %qs
en: 無效的 --param 值 %qs

source: invalid DUID
en: 無效的DUID

source: invalid IACC argument
en: 無效的 IACC 引數

source: invalid JSON at position %d (%s)
en: 位置無效的JSON %d （%s)

source: invalid PC in line number table
en: 列號表中 PC 無效

source: invalid PKCS#11 URI "%s"
en: 無效的PKCS＃11 URI“%s"

source: invalid UNSPEC as operand
en: 無效的 UNSPEC 做為運算元

source: invalid VF %u: %s
en: 無效的VF %u: %s

source: invalid abstract return type for function %q+#D
en: 函式 %q+#D 的抽象回傳類型無效

source: invalid abstract return type for member function %q+#D
en: 成員函式 %q+#D 的抽象回傳類型無效

source: invalid abstract type %qT for %qE
en: 抽象類型 %qT 無效，對於 %qE 無效

source: invalid abstract type for %q+D
en: %q+D 的抽象類型無效

source: invalid access to non-static data member %qD of NULL object
en: 對 NULL 物件非靜態資料成員 %qD 的存取無效

source: invalid address
en: 無效位址

source: invalid alignment for %<#pragma align%>, ignoring
en: %<#pragma align%> 指定的對齊邊界無效，忽略

source: invalid argument to %<__builtin_frame_address%>
en: %<__builtin_frame_address%> 的引數無效

source: invalid argument to %<__builtin_return_address%>
en: %<__builtin_return_address%> 的引數無效

source: invalid boolean value '%s' for attribute '%s'
en: 布尔值 "%s%s" 对属性 "" 无效

source: invalid cast from type %qT to type %qT
en: 從類型 %qT 到類型 %qT 的轉換無效

source: invalid cast of an rvalue expression of type %qT to type %qT
en: 從具有類型 %qT 的右值運算式到類型 %qT 中的轉換無效

source: invalid cast to function type %qT
en: 向函式類型 %qT 的轉換無效

source: invalid const_cast from type %qT to type %qT
en: 從類型 %qT 到類型 %qT 中的 const_cast 無效

source: invalid const_cast of an rvalue of type %qT to type %qT
en: 從類型 %qT 到類型 %qT 中的 const_cast 無效

source: invalid const_double operand
en: 無效的 const_double 運算元

source: invalid constraints for operand
en: 運算元的約束無效

source: invalid constructor; you probably meant %<%T (const %T&)%>
en: 無效的建構式：您要的可能是 %<%T (const %T&)%>

source: invalid conversion from %<__fpreg%>
en: 從 %<__fpreg%> 的轉換無效

source: invalid conversion from %qT to %qT
en: 從類型 %qT 到類型 %qT 的轉換無效

source: invalid conversion to %<__fpreg%>
en: 向 %<__fpreg%> 的轉換無效

source: invalid conversion to type %qT from type %qT
en: 到類型 %qT 的轉換無效，從類型 %qT

source: invalid covariant return type for %q+#D
en: %q+#D 的協變回傳類型無效

source: invalid default argument for a template template parameter
en: 範本的範本參數的預設引數無效

source: invalid definition of qualified type %qT
en: 對限定類型 %qT 的定義無效

source: invalid expression as operand
en: 無效的運算式做為運算元

source: invalid function declaration
en: 無效的函式宣告

source: invalid in-class initialization of static data member of non-integral type %qT
en: 類別中對具有非整數類型 %qT 的靜態資料成員的初始化無效

source: invalid initialization of reference of type %qT from expression of type %qT
en: 將類型為 %qT 的參照初始化為類型為 %qT 的運算式無效

source: invalid initializer
en: 無效的初始值設定

source: invalid insn:
en: 無效指令：

source: invalid key "%s": %s
en: 無效的密鑰 ”%s": %s

source: invalid key '%s.%s'
en: 無效的密鑰 '%s.%s'

source: invalid key/cert value data:;base64, is not base64
en: 無效的密鑰/證書值數據：; base64，不是base64

source: invalid key/cert value data:;base64,file://
en: 無效的密鑰/證書值數據：; base64，file：//

source: invalid key/cert value is not a valid blob
en: 無效的密鑰/證書值不是有效的blob

source: invalid lvalue in asm output %d
en: 組譯輸出 %d 中左值無效

source: invalid mask
en: 無效遮罩

source: invalid member function declaration
en: 無效的成員函式宣告

source: invalid member template declaration %qD
en: 無效的成員範本宣告 %qD

source: invalid operand code '%c'
en: 無效的運算元程式碼「%c」

source: invalid operand for 'A' modifier
en: 「A」修飾符的運算元無效

source: invalid operand for 'D' modifier
en: 「D」修飾符的運算元無效

source: invalid operand for 'H' modifier
en: 「H」修飾符的運算元無效

source: invalid operand for 'O' modifier
en: 「O」修飾符的運算元無效

source: invalid operand for 'T' modifier
en: 「T」修飾符的運算元無效

source: invalid operand for 'b' modifier
en: 「b」修飾符的運算元無效

source: invalid operand for 'e' modifier
en: 「e」修飾符的運算元無效

source: invalid operand for 'm' modifier
en: 「m」修飾符的運算元無效

source: invalid operand for 'o' modifier
en: 「o」修飾符的運算元無效

source: invalid operand for 'p' modifier
en: 「p」修飾符的運算元無效

source: invalid operand for 'z' modifier
en: 「z」修飾符的運算元無效

source: invalid operand modifier letter
en: 無效的運算元修飾符字母

source: invalid operand output code
en: 無效的運算元輸出程式碼

source: invalid operand to %%H/%%L code
en: %%H/%%L 程式碼的運算元無效

source: invalid operand to %%N code
en: %%N 程式碼的運算元無效

source: invalid operand to %%R
en: %%R 的運算元無效

source: invalid operand to %%R code
en: %%R 程式碼的運算元無效

source: invalid operand to %%S
en: %%S 的運算元無效

source: invalid operand to %%T/%%B code
en: %%T/%%B 程式碼的運算元無效

source: invalid operand to %%U code
en: %%U 程式碼的運算元無效

source: invalid operand to %%p code
en: %%p 程式碼的運算元無效

source: invalid operand to %%s code
en: %%s 程式碼的運算元無效

source: invalid operands of types %qT and %qT to binary %qO
en: 運算元類型 %qT 和 %qT 對二進位 %qO 而言無效

source: invalid operation on %<__fpreg%>
en: 對 %<__fpreg%> 的作業無效

source: invalid option '%s' or its value '%s'
en: 不合於規定的選項 '%s' 或其值為 '%s'

source: invalid parameter combination for AltiVec intrinsic
en: 對 AltiVec 內建函式來說無效的參陣列合

source: invalid parameter type %qT
en: 無效的參數類型 %qT

source: invalid path or URI “%s”
en: 無效的路徑或 URI「%s」

source: invalid pointer mode %qs
en: 無效的指標模式 %qs

source: invalid pointer to bit-field %qD
en: 參照位元段 %qD 指標無效

source: invalid port %d
en: 無效的端口 %d

source: invalid prefix length for %s '%s', defaulting to %d
en: 無效的前綴長度 %s “%s', 默認為 %d

source: invalid priority map '%s'
en: 無效的優先順序對映「%s」

source: invalid proxy method
en: 無效的代理方法

source: invalid punctuation %qc in constraint
en: 約束中出現無效的標點 %qc

source: invalid qualifiers on non-member function type
en: 非成員函式類型上的限定符無效

source: invalid qualifying scope in pseudo-destructor name
en: 偽解構函式名的限定作用欄位無效

source: invalid redeclaration of %q+D
en: 對 %q+#D 無效的重宣告

source: invalid register name for %q+D
en: %q+D 的暫存器名無效

source: invalid route: %s. %s
en: 無效路線： %s. %s

source: invalid rtl sharing found in the insn
en: 在 insn 中找到無效的 rtl 分享

source: invalid second argument to %<__builtin_prefetch%>; using zero
en: %<__builtin_prefetch%> 的第二個引數無效；使用 0

source: invalid setting name in 'password' entry '%s'
en: “密碼”條目中的設置名稱無效%s'

source: invalid static_cast from type %qT to type %qT
en: 從類型 %qT 到類型 %qT 中的 static_cast 無效

source: invalid template declaration of %qD
en: %qD 範本宣告無效

source: invalid third argument to %<__builtin_prefetch%>; using zero
en: %<__builtin_prefetch%> 的第三個引數無效；使用 0

source: invalid type %<void%> for new
en: 對 new 而言類型 %<void%> 無效

source: invalid type %qT as initializer for a vector of type %qT
en: 無效類型 %qT 做為類型為 %qT 的向量的初始化設定

source: invalid type %qT declared %<friend%>
en: 無效的類型 %qT 宣告為 %<friend%>

source: invalid types %<%T[%T]%> for array subscript
en: %<%T[%T]%> 做為陣列下標類型無效

source: invalid uint32 value '%s' for attribute '%s'
en: uint32 值 "%s%s" 对属性 "" 无效

source: invalid uint8 value '%s' for attribute '%s'
en: uint8 值 "%s%s" 对属性 "" 无效

source: invalid use of %%d, %%x, or %%X
en: 對 %%d、%%x 或 %%X 的無效使用

source: invalid use of %<restrict%>
en: 錯誤地使用了 %<restrict%>

source: invalid use of %<this%> at top level
en: 在頂層使用 %<this%> 無效

source: invalid use of %<this%> in non-member function
en: 在非成員函式中使用 %<this%> 無效

source: invalid use of %qE to form a pointer-to-member-function
en: 用 %qE 形成成員函式指標的用法無效。

source: invalid use of ':' modifier
en: 錯誤地使用了「:」修飾符

source: invalid use of array with unspecified bounds
en: 對未指定邊界的陣列的無效使用
